Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/legal_aid_and_advice/legal_aid_board.html.txt.tmx
Source language: en
Languages: ga

source: • Cases covered by the Legal Aid Board
ga: • Cásanna a chuimsíonn an Bord um Chúnamh Dlíthiúil

source: The legal Aid Board is a statutory body established under the Civil Legal Aid Act 1995
ga: Comhlacht reachtúil is ea an Bord um Chúnamh Dlíthiúil a bunaíodh faoin Acht um Chúnamh Dlíthiúil, 1995

source: The functions of the Board are:
ga: Seo a leanas na feidhmeanna atá ag an mBord:

source: • To provide legal aid and legal advice in civil cases (i.e., non-criminal cases) to people who meet the criteria
ga: • Comhairle agus cúnamh dlíthiúil a chur ar fáil i gcásanna sibhialta (i.e. cásanna neamhchoiriúla) do dhaoine a chomhlíonann na critéir

source: • To provide a family mediation service
ga: • Seirbhís idirghabhála teaghlaigh a chur ar fáil

source: • To provide information about its services
ga: • Faisnéis a chur ar fáil faoina seirbhísí

source: This Board consists of a chairperson and twelve other members
ga: Is éard atá sa Bhord, cathaoirleach agus dhá bhall déag eile

source: At least five of the members of the Board must be women and five must be men
ga: Ní mór go mbíonn ar a laghad cúigear ball den Bhord ina mná agus ní mór do chúigear bheith ina bhfir

source: Two members of the Board must be barristers, two must be solicitors and two must be members of the staff of the Board
ga: Ní mor do bheirt bhall den Bhord bheith ina n-abhcóidí, ní mór do bheirt bheith ina n-aturnaetha agus ní mór do bheirt bheith mar bhaill foirne den Bhord

source: The Board has a network of full-time and part-time law centres located throughout the country
ga: Tá ag an mBord líonra d’ionaid lánaimseartha agus pháirtaimseartha dlí atá lonnaithe ar fud na tíre

source: The Board has also established a panel of solicitors and barristers in private practice who provide legal aid and advice under the Act
ga: Ina theannta sin, bhunaigh an Bord painéal aturnaetha agus abhcóidí i gcleachtas príobháideach a chuireann cúnamh agus comhairle dhlíthiúil ar fáil faoin Acht

source: If a barrister is required to deal with your case, the Legal Aid Board will appoint one to represent you
ga: Más gá d’abhcóide déileáil le do chás, ceapfaidh an Bord um Chúnamh Dlíthiúil ceann chun ionadaíocht a dhéanamh duit

source: The Board also has a Refugee Legal Service (RLS) that provides an independent legal service to asylum seekers at all stages of the asylum process
ga: Tá Seirbhís Dlí do Dídeanaithe (SDD) ag an mBord freisin. Soláthraíonn sé seirbhís neamhspleách dlí d'iarrthóirí tearmainn ag gach céim den phróiseas tearmainn

source: The Board does not provide direct legal aid or advice in respect of criminal matters, however, it is responsible for the management and administration of 3 ad-hoc criminal legal aid schemes,
ga: Ní dhéanann an Bord cúnamh dlíthiúil díreach nó comhairle maidir le nithe coiriúla a chur ar fáil. Mar sin féin, tá sé freagrach as bainistiú agus riaradh 3 scéim um chúnamh dlíthiúil coiriúil

source: The Board's Family Mediation Service helps couples who have decided to separate or divorce, or who have already separated, to negotiate their own terms of agreement, while addressing the needs and interests of all involved
ga: Cabhraíonn an tSeirbhís Idirghabhála Teaghlaigh le lanúineacha a rinne an cinneadh chun scaradh nó colscaradh a fháil, nó atá scartha cheana féin, chun plé a dhéanammh ar a dtéarmaí féin comhaontaithe, agus dul i ngleic le riachtanais agus le leas gach duine lena mbaineann i gcomhthráth

source: Cases covered by the Legal Aid Board
ga: Cásanna a chuimsíonn an Bord um Chúnamh Dlíthiúil

source: The Legal Aid Board tends to provide legal aid and legal advice in the following areas mainly:
ga: Is gnách go gcuireann an Bord um Chúnamh Dlíthiúil comhairle agus cúnamh dlíthiúil ar fáil go príomha sna limistéir a leanas:

source: • Custody of and access to children
ga: • Caomhnóireacht agus rochtain ar leanaí

source: • Problems relating to hire-purchase agreements
ga: • Fadhbanna lena mbaineann comhaontuithe fruilcheannaigh

source: The Board can give legal advice in most areas
ga: Is féidir leis an mBord comhairle dhlíthiúil a chur ar fáil i bhformhór na limistéar

source: It is prohibited from providing legal aid in the following categories of cases:
ga: Cuirtear cosc orthu as cúnamh dlíthiúil a chur ar fáil sna catagóirí a leanas de chásanna:

source: • Defamation claims (i.e., where a person's reputation has been damaged as a result of libel or slander)
ga: • Maíomh clúmhillte (i.e nuair a dhéantar díobháil do chlú duine mar thoradh ar leabhal nó ar bhéadchaint)

source: • Land disputes (i.e., disputes concerning rights and interests in or over land)
ga: • Ábhair shibhialta a chuimsíonn an nós imeachta um mionéilimh

source: • Civil matters covered by the small claims procedure
ga: • Ceadúnú (ceadúnais úinéirí tithe tábhairne)

source: • Conveyancing (i.e., the legal transfer of a property from one party to another)
ga: aistriú dlíthiúil réadmhaoine ó pháirtí amháin chuig páirtí eile)

source: • Claims made in a representative, fiduciary or official capacity (see note below)
ga: • Maíomh a rinneadh i gcáil ionadaíoch, muiníneach nó oifigiúil (féach nóta thíos)

source: • Claims brought by a person on behalf of a group of persons to establish a precedent on a particular point of law ("test cases")
ga: • Maíomh a ghlacann duine ar son grúpa daoine chun fasach a bhunú ar phointe áirithe dlí (“cásanna samplacha”)

source: • Any other group or representative action ("class actions")
ga: • Aon chaingean ghrúpa nó ionadaíoch (“caingean aicmeach”)

source: Note: Refers to a situation where a person is bringing a case on behalf of someone else or in an official capacity
ga: Nóta: Tagraíonn seo do chás ina bhfuil cás á ghlacadh ag duine ar son duine eile nó i gcáil oifigiúil

source: The 3 ad-hoc criminal legal aid schemes the Board administers are:
ga: Riarann an Bord an 3 scéim chúnamh dlíthiúil coiriúil a leanas:

source: • The Garda Station Legal Advice Revised Scheme
ga: • An Stáisiún na nGardaí Scéim Comhairle Dlí Athbhreithnithe

source: • The Legal Aid – Custody Issues Scheme
ga: • An Chúnamh Dlíthiúil - Scéim Ceisteanna Coimeádta

source: • The Criminal Assets Bureau Ad-hoc Legal Aid Scheme
ga: • An Scéim um Chúnamh Dlí an Bhiúró um Shócmhainní Coiriúla

source: The Board provides legal aid or advice to a complainant in certain criminal cases of sexual offences, including rape, aggravated sexual assault and incest
ga: Cuireann an Bord cúnamh nó comhairle dhlíthiúil ar fáil do ghearánach i gcásanna áirithe coiriúla lena mbaineann ionchúiseamh mar gheall ar réimse cionta gnéasacha, lena n-áirítear éigniú, ionsaí forthromaithe gnéasach agus ciorrú coil

source: A complainant is the person making the complaint
ga: Is é an gearánaí an duine a dhéanann an gearán

source: It also provides legal services in relation to criminal matters to alleged victims of human trafficking
ga: Ina theannta sin, cuireann siad comhairle dhlíthiúil ar fáil maidir le hábhair choiriúla d’íospartaigh a líomhnaítear a bhí thíos le gáinneáil ar dhaoine

source: There is a network of Legal Aid Centres throughout Ireland
ga: Is ann do líonra d'Ionaid um Chúnaimh Dhlíthiúil ar fud na hÉireann
